# Specify Homebrew taps
tap "homebrew/core"                # Core formulae
tap "homebrew/cask"                # Cask formulae for macOS applications
tap "homebrew/cask-fonts"          # Cask formulae for fonts
tap "homebrew/cask-versions"       # Cask formulae for alternate versions of casks
tap "homebrew/services"            # Manage background services with Homebrew
tap "fluxcd/tap"                   # FluxCD tools
tap "go-task/tap"                  # Task runner for Go projects
tap "siderolabs/tap"               # Talos Linux tools

# Install Homebrew packages

# General utilities
brew "age"                         # Simple, modern encryption tool
brew "direnv"                      # Environment switcher for shells
brew "fzf"                         # Command-line fuzzy finder
brew "jq"                          # Command-line JSON processor
brew "moreutils"                   # Additional Unix utilities
brew "yq"                          # Command-line YAML processor

# Development tools
brew "ansible"                     # Automation tool
brew "gcc"                         # GNU Compiler Collection
brew "go-task/tap/go-task"         # Task runner for Go projects
brew "helm"                        # Kubernetes package manager
brew "helmfile"                    # Declarative spec for deploying Helm charts
brew "kustomize"                   # Kubernetes native configuration management
brew "opentofu"                    # Open-source Terraform alternative
brew "sops"                        # Secrets management tool
brew "yamllint"                    # Linter for YAML files

# Kubernetes tools
brew "cilium-cli"                  # CLI for Cilium
brew "kubectl"                     # Kubernetes command-line tool
brew "kubeconform"                 # Kubernetes manifests validation tool
brew "kubernetes-cli"              # Kubernetes command-line tools
brew "stern"                       # Multi-pod and container log tailing for Kubernetes
brew "kubecolor/tap/kubecolor"     # Colorizes kubectl output

# CLI utilities
brew "cloudflared"                 # Cloudflare Tunnel client
brew "flyctl"                      # CLI for Fly.io
brew "k9s"                         # Kubernetes CLI to manage clusters

# FluxCD tools
brew "fluxcd/tap/flux"             # Continuous delivery solution for Kubernetes

# Talos tools
brew "siderolabs/tap/talosctl"     # CLI for Talos Linux
brew "talhelper"                   # Helper tool for Talos Linux

# Additional tools
brew "openbao"                     # Secret management tool

# Install Homebrew casks
cask "font-meslo-lg-nerd-font"     # Meslo Nerd Font for terminal